# RedSploit

Red Team penetration testing CLI tool with interactive shell and automation capabilities.

## Features

- üîß **Interactive Shell** - Full-featured console with tab completion
- üöÄ **Quick CLI Mode** - Run commands directly from terminal
- üéØ **Module System** - Infrastructure, Web, and File modules
- ‚ö° **Shell Completion** - Native bash/zsh completion support
- üìù **Variable Management** - Session-based environment variables

## Quick Start

### Installation

```bash
git clone https://github.com/Thongheng/RedSploit.git
cd RedSploit
sudo ./install.sh
```

This will:
- Install `red` command to `/usr/bin`
- Setup shell completion automatically
- Make the tool accessible from anywhere

**Manual install (no sudo):**
```bash
chmod +x red.py
./red.py
```

### Configuration
RedSploit uses a `config.yaml` file located in the project root. It is automatically created on first run if missing.

### Wordlists
Configure default wordlist paths in `config.yaml` to match your system (e.g., if you are using macOS vs Kali).
```yaml
web:
  wordlists:
    directory: /usr/share/seclists/Discovery/Web-Content/directory-list-2.3-medium.txt
    subdomain: /usr/share/seclists/Discovery/DNS/subdomains-top1million-5000.txt
    vhost: /usr/share/seclists/Discovery/DNS/subdomains-top1million-20000.txt
```

### Command History
Command history is automatically saved to `~/.redsploit_history`. You can recall commands from previous sessions using the Up Arrow key.

## Development
RedSploit is designed to be easily extensible. 

### Adding New Tools
Tools are defined in a data-driven structure within their respective module files (`infra.py`, `web.py`, `file.py`).

**Example (adding a tool to `INFRA_TOOLS`):**
```python
"my_tool": {
    "cmd": "mytool -t {target} --scan",
    "category": "My Category",
    "requires": ["target"]
}
```
The command template automatically injects variables like `{target}`, `{domain}`, `{url}`, and authenticates if `{auth}` is present.

### Usage

**Interactive Mode:**
```bash
red
# or with preset values
red -set -T 10.10.10.10
```

**CLI Mode:**
```bash
red -T 10.10.10.10 -U admin:pass123 -i nmap -p-
red -w -T example.com -gobuster
red -f -T 10.10.10.10 -download /etc/passwd
```

**Command Flags:**

When running commands, you can use these flags to modify behavior:

| Flag | Description | Example |
|------|-------------|---------|
| `-c` / `--copy` | Copy command to clipboard without executing | `red -T 10.10.10.10 -w -dir_ferox -c` |
| `-p` / `--preview` | Preview the command without executing | `red -T 10.10.10.10 -i -nmap -p` |
| `-e` / `--edit` | Edit the command before execution | `red -T 10.10.10.10 -w -nuclei -e` |
| `-auth` | Use credentials from session (interactive mode only) | `smbclient -auth` |

**Set Variables:**
```bash
red -T 10.10.10.10      # Set target
red -U admin:pass       # Set user credentials (auto-splits to username:password)
red -D WORKGROUP        # Set domain
red -H <ntlm_hash>      # Set NTLM hash
```

## Available Modules

| Flag | Module | Description |
|------|--------|-------------|
| `-i` | infra | Infrastructure enumeration (nmap, rustscan) |
| `-w` | web | Web reconnaissance (gobuster, nuclei, etc.) |
| `-f` | file | File operations (download, upload, servers) |

## Variables

| Name | Description |
|------|-------------|
| `target` | Target IP/hostname/CIDR |
| `user` | User credentials (auto-splits on `:` to username and password) |
| `username` | Username (auto-set from user variable) |
| `password` | Password (auto-set from user variable) |
| `domain` | Domain name (default: .) |
| `hash` | NTLM hash (alternative to password) |
| `interface` | Network interface |
| `lport` | Local port for reverse shells (default: 4444) |
| `workspace` | Workspace name (default: default) |

## Credential Handling

RedSploit supports flexible credential management with automatic splitting and mode-based authentication:

**Auto-Split Credentials:**
```bash
# Set username and password in one command
red -set user admin:password123
# Automatically creates: username=admin, password=password123

# Or set username only
red -set user admin
```

**Mode-Based Authentication:**

- **CLI Mode**: Automatically uses credentials when available
  ```bash
  # With credentials - auto-applied
  red -T 10.10.10.10 -U admin:pass -i -smb-c
  
  # Without credentials - uses NULL session
  red -T 10.10.10.10 -i -smb-c
  ```

  # With credentials (use -auth flag)
  > smbclient -auth
  ```

## Loot Locker (Credential Management)

RedSploit includes a built-in **Loot Locker** to manage credentials found during engagements. It allows you to store, organize, and active credentials on the fly.

**Commands:**

- `loot add <content> [service] [type]`: Add new loot
- `loot show`: List captured loot
- `loot use <id>`: **Load loot into session variables** (sets user/password/hash)
- `loot rm <id>`: Remove loot

**Usage Example:**

```bash
# 1. Capture a credential
> loot add admin:Secret123 smb cred
[+] Added loot: admin:Secret123 (cred)

# 2. List available loot
> loot show
ID   Type       Target          Service    Content                                  
----------------------------------------------
1    cred                       smb        admin:Secret123                        

# 3. Use the credential (Populates session variables)
> loot use 1
[+] Loaded loot #1 into session variables.

# 4. Run tools with the loaded credential
> smbclient -auth
```

> **Note**: The `service` and `target` fields in `loot add` are optional metadata to help you organize your loot. They do not restrict usage.

## Interactive Playbooks

Playbooks allow you to run semi-automated workflows defined in YAML files. This ensures consistency while keeping the operator in control (Human-in-the-loop).

**Commands:**

- `playbook list`: Show available playbooks
- `playbook run <name>`: Execute a playbook

**Example Workflow:**

```bash
> set target 10.10.10.10
> playbook run recon
```

Playbooks are stored in the `playbooks/` directory. You can create your own YAML files to define custom workflows.

## Examples

```bash
# Quick nmap scan
red -T 10.10.10.10 -i -nmap

# Web directory enumeration
red -T example.com -w -dir_ffuf

# SMB enumeration with credentials (CLI auto-auth)
red -T 10.10.10.10 -U admin:pass -i -smb-c

# SMB enumeration without credentials (NULL session)
red -T 10.10.10.10 -i -smb-c

# Interactive mode with credentials
red -i
> set target 10.10.10.10
> set user admin:password
> use infra
> smbclient -auth  # Use credentials
> smbmap           # NULL session (default)
```

## License

MIT
